{
  "class_name": "Sequential",
  "config": {
    "name": "sequential_10",
    "layers": [
      {
        "class_name": "Conv2D",
        "config": {
          "name": "conv2d_64",
          "trainable": true,
          "batch_input_shape": [null, 64, 64, 1],
          "dtype": "float32",
          "filters": 32,
          "kernel_size": [3, 3],
          "strides": [1, 1],
          "padding": "same",
          "data_format": "channels_last",
          "dilation_rate": [1, 1],
          "activation": "linear",
          "use_bias": true,
          "kernel_initializer": {
            "class_name": "VarianceScaling",
            "config": {
              "scale": 1.0,
              "mode": "fan_avg",
              "distribution": "uniform",
              "seed": null
            }
          },
          "bias_initializer": { "class_name": "Zeros", "config": {} },
          "kernel_regularizer": null,
          "bias_regularizer": null,
          "activity_regularizer": null,
          "kernel_constraint": null,
          "bias_constraint": null
        }
      },
      {
        "class_name": "BatchNormalization",
        "config": {
          "name": "batch_normalization_64",
          "trainable": true,
          "axis": -1,
          "momentum": 0.99,
          "epsilon": 0.001,
          "center": true,
          "scale": true,
          "beta_initializer": { "class_name": "Zeros", "config": {} },
          "gamma_initializer": { "class_name": "Ones", "config": {} },
          "moving_mean_initializer": { "class_name": "Zeros", "config": {} },
          "moving_variance_initializer": { "class_name": "Ones", "config": {} },
          "beta_regularizer": null,
          "gamma_regularizer": null,
          "beta_constraint": null,
          "gamma_constraint": null
        }
      },
      {
        "class_name": "Activation",
        "config": {
          "name": "activation_91",
          "trainable": true,
          "activation": "elu"
        }
      },
      {
        "class_name": "MaxPooling2D",
        "config": {
          "name": "max_pooling2d_46",
          "trainable": true,
          "pool_size": [2, 2],
          "padding": "valid",
          "strides": [2, 2],
          "data_format": "channels_last"
        }
      },
      {
        "class_name": "Dropout",
        "config": {
          "name": "dropout_64",
          "trainable": true,
          "rate": 0.2,
          "noise_shape": null,
          "seed": null
        }
      },
      {
        "class_name": "Conv2D",
        "config": {
          "name": "conv2d_65",
          "trainable": true,
          "filters": 64,
          "kernel_size": [3, 3],
          "strides": [1, 1],
          "padding": "same",
          "data_format": "channels_last",
          "dilation_rate": [1, 1],
          "activation": "linear",
          "use_bias": true,
          "kernel_initializer": {
            "class_name": "VarianceScaling",
            "config": {
              "scale": 1.0,
              "mode": "fan_avg",
              "distribution": "uniform",
              "seed": null
            }
          },
          "bias_initializer": { "class_name": "Zeros", "config": {} },
          "kernel_regularizer": null,
          "bias_regularizer": null,
          "activity_regularizer": null,
          "kernel_constraint": null,
          "bias_constraint": null
        }
      },
      {
        "class_name": "BatchNormalization",
        "config": {
          "name": "batch_normalization_65",
          "trainable": true,
          "axis": -1,
          "momentum": 0.99,
          "epsilon": 0.001,
          "center": true,
          "scale": true,
          "beta_initializer": { "class_name": "Zeros", "config": {} },
          "gamma_initializer": { "class_name": "Ones", "config": {} },
          "moving_mean_initializer": { "class_name": "Zeros", "config": {} },
          "moving_variance_initializer": { "class_name": "Ones", "config": {} },
          "beta_regularizer": null,
          "gamma_regularizer": null,
          "beta_constraint": null,
          "gamma_constraint": null
        }
      },
      {
        "class_name": "Activation",
        "config": {
          "name": "activation_92",
          "trainable": true,
          "activation": "elu"
        }
      },
      {
        "class_name": "MaxPooling2D",
        "config": {
          "name": "max_pooling2d_47",
          "trainable": true,
          "pool_size": [2, 2],
          "padding": "valid",
          "strides": [2, 2],
          "data_format": "channels_last"
        }
      },
      {
        "class_name": "Dropout",
        "config": {
          "name": "dropout_65",
          "trainable": true,
          "rate": 0.2,
          "noise_shape": null,
          "seed": null
        }
      },
      {
        "class_name": "Conv2D",
        "config": {
          "name": "conv2d_66",
          "trainable": true,
          "filters": 128,
          "kernel_size": [3, 3],
          "strides": [1, 1],
          "padding": "same",
          "data_format": "channels_last",
          "dilation_rate": [1, 1],
          "activation": "linear",
          "use_bias": true,
          "kernel_initializer": {
            "class_name": "VarianceScaling",
            "config": {
              "scale": 1.0,
              "mode": "fan_avg",
              "distribution": "uniform",
              "seed": null
            }
          },
          "bias_initializer": { "class_name": "Zeros", "config": {} },
          "kernel_regularizer": null,
          "bias_regularizer": null,
          "activity_regularizer": null,
          "kernel_constraint": null,
          "bias_constraint": null
        }
      },
      {
        "class_name": "BatchNormalization",
        "config": {
          "name": "batch_normalization_66",
          "trainable": true,
          "axis": -1,
          "momentum": 0.99,
          "epsilon": 0.001,
          "center": true,
          "scale": true,
          "beta_initializer": { "class_name": "Zeros", "config": {} },
          "gamma_initializer": { "class_name": "Ones", "config": {} },
          "moving_mean_initializer": { "class_name": "Zeros", "config": {} },
          "moving_variance_initializer": { "class_name": "Ones", "config": {} },
          "beta_regularizer": null,
          "gamma_regularizer": null,
          "beta_constraint": null,
          "gamma_constraint": null
        }
      },
      {
        "class_name": "Activation",
        "config": {
          "name": "activation_93",
          "trainable": true,
          "activation": "elu"
        }
      },
      {
        "class_name": "MaxPooling2D",
        "config": {
          "name": "max_pooling2d_48",
          "trainable": true,
          "pool_size": [2, 2],
          "padding": "valid",
          "strides": [2, 2],
          "data_format": "channels_last"
        }
      },
      {
        "class_name": "Dropout",
        "config": {
          "name": "dropout_66",
          "trainable": true,
          "rate": 0.2,
          "noise_shape": null,
          "seed": null
        }
      },
      {
        "class_name": "Conv2D",
        "config": {
          "name": "conv2d_67",
          "trainable": true,
          "filters": 256,
          "kernel_size": [3, 3],
          "strides": [1, 1],
          "padding": "same",
          "data_format": "channels_last",
          "dilation_rate": [1, 1],
          "activation": "linear",
          "use_bias": true,
          "kernel_initializer": {
            "class_name": "VarianceScaling",
            "config": {
              "scale": 1.0,
              "mode": "fan_avg",
              "distribution": "uniform",
              "seed": null
            }
          },
          "bias_initializer": { "class_name": "Zeros", "config": {} },
          "kernel_regularizer": null,
          "bias_regularizer": null,
          "activity_regularizer": null,
          "kernel_constraint": null,
          "bias_constraint": null
        }
      },
      {
        "class_name": "BatchNormalization",
        "config": {
          "name": "batch_normalization_67",
          "trainable": true,
          "axis": -1,
          "momentum": 0.99,
          "epsilon": 0.001,
          "center": true,
          "scale": true,
          "beta_initializer": { "class_name": "Zeros", "config": {} },
          "gamma_initializer": { "class_name": "Ones", "config": {} },
          "moving_mean_initializer": { "class_name": "Zeros", "config": {} },
          "moving_variance_initializer": { "class_name": "Ones", "config": {} },
          "beta_regularizer": null,
          "gamma_regularizer": null,
          "beta_constraint": null,
          "gamma_constraint": null
        }
      },
      {
        "class_name": "Activation",
        "config": {
          "name": "activation_94",
          "trainable": true,
          "activation": "elu"
        }
      },
      {
        "class_name": "Conv2D",
        "config": {
          "name": "conv2d_68",
          "trainable": true,
          "filters": 256,
          "kernel_size": [3, 3],
          "strides": [1, 1],
          "padding": "valid",
          "data_format": "channels_last",
          "dilation_rate": [1, 1],
          "activation": "linear",
          "use_bias": true,
          "kernel_initializer": {
            "class_name": "VarianceScaling",
            "config": {
              "scale": 1.0,
              "mode": "fan_avg",
              "distribution": "uniform",
              "seed": null
            }
          },
          "bias_initializer": { "class_name": "Zeros", "config": {} },
          "kernel_regularizer": null,
          "bias_regularizer": null,
          "activity_regularizer": null,
          "kernel_constraint": null,
          "bias_constraint": null
        }
      },
      {
        "class_name": "BatchNormalization",
        "config": {
          "name": "batch_normalization_68",
          "trainable": true,
          "axis": -1,
          "momentum": 0.99,
          "epsilon": 0.001,
          "center": true,
          "scale": true,
          "beta_initializer": { "class_name": "Zeros", "config": {} },
          "gamma_initializer": { "class_name": "Ones", "config": {} },
          "moving_mean_initializer": { "class_name": "Zeros", "config": {} },
          "moving_variance_initializer": { "class_name": "Ones", "config": {} },
          "beta_regularizer": null,
          "gamma_regularizer": null,
          "beta_constraint": null,
          "gamma_constraint": null
        }
      },
      {
        "class_name": "Activation",
        "config": {
          "name": "activation_95",
          "trainable": true,
          "activation": "elu"
        }
      },
      {
        "class_name": "MaxPooling2D",
        "config": {
          "name": "max_pooling2d_49",
          "trainable": true,
          "pool_size": [2, 2],
          "padding": "valid",
          "strides": [2, 2],
          "data_format": "channels_last"
        }
      },
      {
        "class_name": "Dropout",
        "config": {
          "name": "dropout_67",
          "trainable": true,
          "rate": 0.2,
          "noise_shape": null,
          "seed": null
        }
      },
      {
        "class_name": "Conv2D",
        "config": {
          "name": "conv2d_69",
          "trainable": true,
          "filters": 512,
          "kernel_size": [2, 2],
          "strides": [1, 1],
          "padding": "same",
          "data_format": "channels_last",
          "dilation_rate": [1, 1],
          "activation": "linear",
          "use_bias": true,
          "kernel_initializer": {
            "class_name": "VarianceScaling",
            "config": {
              "scale": 1.0,
              "mode": "fan_avg",
              "distribution": "uniform",
              "seed": null
            }
          },
          "bias_initializer": { "class_name": "Zeros", "config": {} },
          "kernel_regularizer": null,
          "bias_regularizer": null,
          "activity_regularizer": null,
          "kernel_constraint": null,
          "bias_constraint": null
        }
      },
      {
        "class_name": "BatchNormalization",
        "config": {
          "name": "batch_normalization_69",
          "trainable": true,
          "axis": -1,
          "momentum": 0.99,
          "epsilon": 0.001,
          "center": true,
          "scale": true,
          "beta_initializer": { "class_name": "Zeros", "config": {} },
          "gamma_initializer": { "class_name": "Ones", "config": {} },
          "moving_mean_initializer": { "class_name": "Zeros", "config": {} },
          "moving_variance_initializer": { "class_name": "Ones", "config": {} },
          "beta_regularizer": null,
          "gamma_regularizer": null,
          "beta_constraint": null,
          "gamma_constraint": null
        }
      },
      {
        "class_name": "Activation",
        "config": {
          "name": "activation_96",
          "trainable": true,
          "activation": "elu"
        }
      },
      {
        "class_name": "Conv2D",
        "config": {
          "name": "conv2d_70",
          "trainable": true,
          "filters": 512,
          "kernel_size": [2, 2],
          "strides": [1, 1],
          "padding": "valid",
          "data_format": "channels_last",
          "dilation_rate": [1, 1],
          "activation": "linear",
          "use_bias": true,
          "kernel_initializer": {
            "class_name": "VarianceScaling",
            "config": {
              "scale": 1.0,
              "mode": "fan_avg",
              "distribution": "uniform",
              "seed": null
            }
          },
          "bias_initializer": { "class_name": "Zeros", "config": {} },
          "kernel_regularizer": null,
          "bias_regularizer": null,
          "activity_regularizer": null,
          "kernel_constraint": null,
          "bias_constraint": null
        }
      },
      {
        "class_name": "BatchNormalization",
        "config": {
          "name": "batch_normalization_70",
          "trainable": true,
          "axis": -1,
          "momentum": 0.99,
          "epsilon": 0.001,
          "center": true,
          "scale": true,
          "beta_initializer": { "class_name": "Zeros", "config": {} },
          "gamma_initializer": { "class_name": "Ones", "config": {} },
          "moving_mean_initializer": { "class_name": "Zeros", "config": {} },
          "moving_variance_initializer": { "class_name": "Ones", "config": {} },
          "beta_regularizer": null,
          "gamma_regularizer": null,
          "beta_constraint": null,
          "gamma_constraint": null
        }
      },
      {
        "class_name": "Activation",
        "config": {
          "name": "activation_97",
          "trainable": true,
          "activation": "elu"
        }
      },
      {
        "class_name": "MaxPooling2D",
        "config": {
          "name": "max_pooling2d_50",
          "trainable": true,
          "pool_size": [2, 2],
          "padding": "valid",
          "strides": [2, 2],
          "data_format": "channels_last"
        }
      },
      {
        "class_name": "Dropout",
        "config": {
          "name": "dropout_68",
          "trainable": true,
          "rate": 0.2,
          "noise_shape": null,
          "seed": null
        }
      },
      {
        "class_name": "Flatten",
        "config": {
          "name": "flatten_10",
          "trainable": true,
          "data_format": "channels_last"
        }
      },
      {
        "class_name": "Dense",
        "config": {
          "name": "dense_28",
          "trainable": true,
          "units": 1024,
          "activation": "linear",
          "use_bias": true,
          "kernel_initializer": {
            "class_name": "VarianceScaling",
            "config": {
              "scale": 1.0,
              "mode": "fan_avg",
              "distribution": "uniform",
              "seed": null
            }
          },
          "bias_initializer": { "class_name": "Zeros", "config": {} },
          "kernel_regularizer": null,
          "bias_regularizer": null,
          "activity_regularizer": null,
          "kernel_constraint": null,
          "bias_constraint": null
        }
      },
      {
        "class_name": "Activation",
        "config": {
          "name": "activation_98",
          "trainable": true,
          "activation": "elu"
        }
      },
      {
        "class_name": "Dropout",
        "config": {
          "name": "dropout_69",
          "trainable": true,
          "rate": 0.2,
          "noise_shape": null,
          "seed": null
        }
      },
      {
        "class_name": "Dense",
        "config": {
          "name": "dense_29",
          "trainable": true,
          "units": 512,
          "activation": "linear",
          "use_bias": true,
          "kernel_initializer": {
            "class_name": "VarianceScaling",
            "config": {
              "scale": 1.0,
              "mode": "fan_avg",
              "distribution": "uniform",
              "seed": null
            }
          },
          "bias_initializer": { "class_name": "Zeros", "config": {} },
          "kernel_regularizer": null,
          "bias_regularizer": null,
          "activity_regularizer": null,
          "kernel_constraint": null,
          "bias_constraint": null
        }
      },
      {
        "class_name": "Activation",
        "config": {
          "name": "activation_99",
          "trainable": true,
          "activation": "elu"
        }
      },
      {
        "class_name": "Dropout",
        "config": {
          "name": "dropout_70",
          "trainable": true,
          "rate": 0.2,
          "noise_shape": null,
          "seed": null
        }
      },
      {
        "class_name": "Dense",
        "config": {
          "name": "dense_30",
          "trainable": true,
          "units": 7,
          "activation": "linear",
          "use_bias": true,
          "kernel_initializer": {
            "class_name": "VarianceScaling",
            "config": {
              "scale": 1.0,
              "mode": "fan_avg",
              "distribution": "uniform",
              "seed": null
            }
          },
          "bias_initializer": { "class_name": "Zeros", "config": {} },
          "kernel_regularizer": null,
          "bias_regularizer": null,
          "activity_regularizer": null,
          "kernel_constraint": null,
          "bias_constraint": null
        }
      },
      {
        "class_name": "Activation",
        "config": {
          "name": "activation_100",
          "trainable": true,
          "activation": "softmax"
        }
      }
    ]
  },
  "keras_version": "2.2.4",
  "backend": "tensorflow"
}
